import time
import akshare as ak
import numpy as np
from numpy import empty
import pandas as pd
import datetime as dt

# 处理时间
from dateutil.parser import parse
from datetime import datetime, timedelta
from chinese_calendar import is_workday, is_holiday

from utils_stock import *

debug_num = 20000000000000000
# action_date = dt.date.today()
action_date = '2024-12-26'
save_file = 'stock_A_2024_12_26'
stocks_code =[('000755', '山西高速'), ('688071', '华依科技'), ('603518', '锦泓集团'), ('600933', '爱柯迪'), ('603335', '迪生力'), ('002283', '天润工业'), ('605555', '德昌股份'), ('002918', '蒙娜丽莎'), ('002225', '濮耐股份'), ('688686', '奥普特'), ('002915', '中欣氟材'), ('001217', '华尔泰'), ('002576', '通达动力'), ('301009', '可靠股份'), ('603897', '长城科技'), ('301413', '安培龙'), ('002362', '汉王科技'), ('300503', '昊志机电'), ('300383', '光环新网'), ('603881', '数据港'), ('002860', '星帅尔'), ('000564', '供销大集'), ('603648', '畅联股份'), ('300504', '天邑股份'), ('605133', '嵘泰股份'), ('688088', '虹软科技'), ('688286', '敏芯股份'), ('002139', '拓邦股份'), ('002796', '世嘉科技'), ('002927', '泰永长征'), ('301428', '世纪恒通'), ('002979', '雷赛智能'), ('603728', '鸣志电器'), ('000788', '北大医药'), ('002526', '山东矿机'), ('600300', '维维股份'), ('002632', '道明光学'), ('600729', '重庆百货'), ('002046', '国机精工'), ('688068', '热景生物'), ('300109', '新开源'), ('300040', '九洲集团'), ('603843', '正平股份'), ('603701', '德宏股份'), ('300906', '日月明'), ('600593', '大连圣亚'), ('001258', '立新能源'), ('603379', '三美股份'), ('600827', '百联股份'), ('301498', '乖宝宠物'), ('605089', '味知香'), ('603633', '徕木股份'), ('003021', '兆威机电'), ('000813', '德展健康'), ('600088', '中视传媒'), ('301187', '欧圣电气'), ('000627', '天茂集团'), ('002919', '名臣健康'), ('601113', '华鼎股份'), ('601869', '长飞光纤'), ('301027', '华蓝集团'), ('300938', '信测标准'), ('601086', '国芳集团'), ('002115', '三维通信'), ('300828', '锐新科技'), ('002186', '全 聚 德'), ('300857', '协创数据'), ('002963', '豪尔赛'), ('603085', '天成自控'), ('603353', '和顺石油'), ('603598', '引力传媒'), ('002148', '北纬科技'), ('001222', '源飞宠物'), ('002481', '双塔食品'), ('002193', '如意集团'), ('300622', '博士眼镜'), ('002395', '双象股份'), ('002886', '沃特股份'), ('300826', '测绘股份'), ('300113', '顺网科技'), ('603341', '龙旗科技'), ('002171', '楚江新材'), ('301303', '真兰仪表'), ('603088', '宁波精达'), ('002080', '中材科技'), ('600986', '浙文互联'), ('688129', '东来技术'), ('603181', '皇马科技'), ('002697', '红旗连锁'), ('600503', '华丽家族'), ('301233', '盛帮股份'), ('002541', '鸿路钢构'), ('002582', '好想你'), ('605337', '李子园'), ('002320', '海峡股份'), ('300701', '森霸传感'), ('000925', '众合科技'), ('301123', '奕东电子'), ('300706', '阿石创'), ('600157', '永泰能源'), ('605338', '巴比食品'), ('603300', '海南华铁'), ('688571', '杭华股份'), ('603275', '众辰科技'), ('002520', '日发精机'), ('000981', '山子高科'), ('600160', '巨化股份'), ('600982', '宁波能源'), ('002864', '盘龙药业'), ('300973', '立高食品'), ('605050', '福然德'), ('688097', '博众精工'), ('002670', '国盛金控'), ('600618', '氯碱化工'), ('002026', '山东威达'), ('300603', '立昂技术'), ('605336', '帅丰电器'), ('688733', '壹石通'), ('603819', '神力股份'), ('688548', '广钢气体'), ('001282', '三联锻造'), ('301055', '张小泉'), ('600858', '银座股份'), ('002315', '焦点科技'), ('605018', '长华集团'), ('603536', '惠发食品'), ('603609', '禾丰股份'), ('300558', '贝达药业'), ('600853', '龙建股份'), ('301390', '经纬股份'), ('002042', '华孚时尚'), ('603163', '圣晖集成'), ('688521', '芯原股份'), ('301045', '天禄科技'), ('300022', '吉峰科技'), ('688255', '凯尔达'), ('300627', '华测导航'), ('002563', '森马服饰'), ('605088', '冠盛股份'), ('002568', '百润股份'), ('002354', '天娱数科'), ('301199', '迈赫股份'), ('002695', '煌上煌'), ('000678', '襄阳轴承'), ('603489', '八方股份'), ('603733', '仙鹤股份'), ('000534', '万泽股份'), ('603344', '星德胜'), ('600882', '妙可蓝多'), ('301019', '宁波色母'), ('601238', '广汽集团'), ('300384', '三联虹普'), ('002815', '崇达技术'), ('300990', '同飞股份'), ('002121', '科陆电子'), ('300960', '通业科技'), ('000912', '泸天化'), ('002062', '宏润建设'), ('600158', '中体产业'), ('301446', '福事特'), ('002990', '盛视科技'), ('002905', '金逸影视'), ('300932', '三友联众'), ('600829', '人民同泰'), ('603999', '读者传媒'), ('301186', '超达装备'), ('002482', '广田集团'), ('300231', '银信科技'), ('600506', '统一股份'), ('603516', '淳中科技'), ('601798', '蓝科高新'), ('835174', '五新隧装'), ('603103', '横店影视'), ('000882', '华联股份'), ('300412', '迦南科技'), ('300326', '凯利泰'), ('300561', '汇金科技'), ('603040', '新坐标'), ('688613', '奥精医疗'), ('003033', '征和工业'), ('300866', '安克创新'), ('603696', '安记食品'), ('601609', '金田股份'), ('600716', '凤凰股份'), ('002187', '广百股份'), ('300991', '创益通'), ('600104', '上汽集团'), ('600868', '梅雁吉祥'), ('002337', '赛象科技'), ('002216', '三全食品')]


stock_daily, stock_weekly, stock_monthly = {}, {}, {}
for i in range(min(len(stocks_code), debug_num)):
    try:
        # print('**** load K line : ', stocks_code[i][0])
        stock_daily[stocks_code[i][0]], stock_weekly[stocks_code[i][0]], stock_monthly[stocks_code[i][0]] = \
            load_stocks(save_file, action_date, stocks_code[i][0])

        # print(stock_daily[stocks_code[i][0]][['日期', '收盘', '成交量']])
        # print(stock_weekly[stocks_code[i][0]][['日期', '收盘', '成交量']])
        # print(stock_monthly[stocks_code[i][0]][['日期', '收盘', '成交量']])
    except:
        print('**** has no day week month K line: ', stocks_code[i][0])
print('*' * 50 + ' 03 召回数据完毕')

win_rate_list = []
stocks_code_industry_concept = {}
for i in range(min(len(stocks_code), debug_num)):
    stock_data = stock_daily[stocks_code[i][0]][['日期', '涨跌幅']]
    win_rate_list.append(stock_data.iloc[-1, 1])
    stocks_code_industry_concept[stocks_code[i][0]] = [[], [], stock_data.iloc[-1, 1], stocks_code[i][1]]

industry_list = ak.stock_board_industry_name_em()
concept_list = ak.stock_board_concept_name_em()

for name in list(industry_list['板块名称']):
    industry_stock = ak.stock_board_industry_cons_em(name)
    for i in range(min(len(stocks_code), debug_num)):
        if stocks_code[i][0] in list(industry_stock['代码']):
            stocks_code_industry_concept[stocks_code[i][0]][0].append(name)

for name in list(concept_list['板块名称']):
    concept_stocks = ak.stock_board_concept_cons_em(name)
    for i in range(min(len(stocks_code), debug_num)):
        if stocks_code[i][0] in list(concept_stocks['代码']):
            stocks_code_industry_concept[stocks_code[i][0]][1].append(name)

print('*' * 20 + ' 明细情况')
print('*' * 20 + ' 分析日期: ', action_date, ', 读取文件夹', save_file)

# for i in range(min(len(stocks_code), debug_num)):
#     print(stocks_code[i][0], stocks_code[i][1],
#           ' , 涨跌幅:', stocks_code_industry_concept[stocks_code[i][0]][2],
#           ' , 行业:', stocks_code_industry_concept[stocks_code[i][0]][0],
#           ' , 概念:', stocks_code_industry_concept[stocks_code[i][0]][1])

stocks_code_sorted = dict(sorted(stocks_code_industry_concept.items(),
                                 key=lambda item: item[1][2],
                                 reverse=True))
for key, val in stocks_code_sorted.items():
    print(key, val[3], ' ,涨跌幅:', val[2], ' ,行业:', val[0], ' ,概念:', val[1])

print('*' * 20 + ' 胜率情况')
win_num = len([1 for i in win_rate_list if i > 0])
print(win_num, len(win_rate_list), win_num / len(win_rate_list))
