import time
import akshare as ak
import numpy as np
from numpy import empty
import pandas as pd
import datetime as dt

# 处理时间
from dateutil.parser import parse
from datetime import datetime, timedelta
from chinese_calendar import is_workday, is_holiday

from utils_stock import *

debug_num = 20000000000000000
# action_date = dt.date.today()
action_date = '2024-12-19'
save_file = 'stock_A_2024_12_19'
stocks_code = [('002186', '全 聚 德'), ('002702', '海欣食品'), ('605018', '长华集团'), ('600137', '浪莎股份'),
               ('603121', '华培动力'), ('600827', '百联股份'), ('300412', '迦南科技'), ('002172', '澳洋健康'),
               ('301018', '申菱环境'), ('688548', '广钢气体'), ('002131', '利欧股份'), ('300270', '中威电子'),
               ('001222', '源飞宠物'), ('600858', '银座股份'), ('605338', '巴比食品'), ('688737', '中自科技'),
               ('002796', '世嘉科技'), ('600851', '海欣股份'), ('600882', '妙可蓝多'), ('002127', '南极电商'),
               ('002860', '星帅尔'), ('600697', '欧亚集团'), ('002878', '元隆雅图'), ('300703', '创源股份'),
               ('603897', '长城科技'), ('000530', '冰山冷热'), ('688219', '会通股份'), ('300903', '科翔股份'),
               ('688620', '安凯微'), ('600618', '氯碱化工'), ('603126', '中材节能'), ('601969', '海南矿业'),
               ('300830', '金现代'), ('600616', '金枫酒业'), ('301198', '喜悦智行'), ('002105', '信隆健康'),
               ('002689', '远大智能'), ('002114', '罗平锌电'), ('300651', '金陵体育'), ('002946', '新乳业'),
               ('002481', '双塔食品'), ('000882', '华联股份'), ('002541', '鸿路钢构'), ('605337', '李子园'),
               ('002576', '通达动力'), ('600829', '人民同泰'), ('301027', '华蓝集团'), ('603223', '恒通股份'),
               ('603533', '掌阅科技'), ('300399', '天利科技'), ('002789', '建艺集团'), ('301228', '实朴检测'),
               ('603216', '梦天家居'), ('300503', '昊志机电'), ('300242', '佳云科技'), ('605108', '同庆楼'),
               ('300793', '佳禾智能'), ('002320', '海峡股份'), ('688217', '睿昂基因'), ('000788', '北大医药'),
               ('000631', '顺发恒业'), ('603759', '海天股份'), ('002915', '中欣氟材'), ('002551', '尚荣医疗'),
               ('600959', '江苏有线'), ('002587', '奥拓电子'), ('603843', '正平股份'), ('600337', '美克家居'),
               ('002362', '汉王科技'), ('600853', '龙建股份'), ('002563', '森马服饰'), ('002139', '拓邦股份'),
               ('002747', '埃斯顿'), ('601011', '宝泰隆'), ('300612', '宣亚国际'), ('600630', '龙头股份'),
               ('002470', '金正大'), ('300040', '九洲集团'), ('603696', '安记食品'), ('603818', '曲美家居'),
               ('300488', '恒锋工具'), ('000892', '欢瑞世纪'), ('002547', '春兴精工'), ('300113', '顺网科技'),
               ('605388', '均瑶健康'), ('002337', '赛象科技'), ('600097', '开创国际'), ('300701', '森霸传感'),
               ('002899', '英派斯'), ('301125', '腾亚精工'), ('600673', '东阳光'), ('600857', '宁波中百'),
               ('600706', '曲江文旅'), ('601086', '国芳集团'), ('002286', '保龄宝'), ('688178', '万德斯'),
               ('300829', '金丹科技'), ('301303', '真兰仪表'), ('002350', '北京科锐'), ('300182', '捷成股份'),
               ('601609', '金田股份'), ('002678', '珠江钢琴'), ('600429', '三元股份'), ('603719', '良品铺子'),
               ('301102', '兆讯传媒'), ('688669', '聚石化学'), ('000698', '沈阳化工'), ('300109', '新开源'),
               ('601238', '广汽集团'), ('603519', '立霸股份'), ('688360', '德马科技'), ('002068', '黑猫股份'),
               ('601188', '龙江交通'), ('000534', '万泽股份'), ('605088', '冠盛股份'), ('600626', '申达股份'),
               ('605389', '长龄液压'), ('000735', '罗 牛 山'), ('600335', '国机汽车'), ('300692', '中环环保'),
               ('301007', '德迈仕'), ('605555', '德昌股份'), ('688098', '申联生物'), ('002535', '林州重机'),
               ('300932', '三友联众'), ('002171', '楚江新材'), ('603609', '禾丰股份'), ('300430', '诚益通'),
               ('002164', '宁波东力'), ('002643', '万润股份'), ('002497', '雅化集团'), ('301302', '华如科技'),
               ('301113', '雅艺科技'), ('002631', '德尔未来'), ('603002', '宏昌电子'), ('300528', '幸福蓝海'),
               ('002990', '盛视科技'), ('300326', '凯利泰'), ('002292', '奥飞娱乐'), ('002857', '三晖电气'),
               ('000156', '华数传媒'), ('300945', '曼卡龙'), ('002886', '沃特股份'), ('001209', '洪兴股份'),
               ('600313', '农发种业'), ('603180', '金牌家居'), ('002198', '嘉应制药'), ('300448', '浩云科技'),
               ('002046', '国机精工'), ('301335', '天元宠物'), ('600191', '华资实业'), ('301235', '华康医疗'),
               ('002530', '金财互联'), ('000627', '天茂集团'), ('601798', '蓝科高新'), ('688255', '凯尔达'),
               ('000716', '黑芝麻'), ('605155', '西大门'), ('002069', '獐子岛'), ('301116', '益客食品'),
               ('605319', '无锡振华'), ('688529', '豪森智能'), ('600576', '祥源文旅'), ('000678', '襄阳轴承'),
               ('002398', '垒知集团'), ('000890', '法尔胜'), ('002826', '易明医药'), ('300711', '广哈通信'),
               ('002177', '御银股份'), ('003033', '征和工业'), ('603637', '镇海股份'), ('600354', '敦煌种业'),
               ('603116', '红蜻蜓'), ('000710', '贝瑞基因'), ('001231', '农心科技'), ('600082', '海泰发展'),
               ('688373', '盟科药业-U'), ('600668', '尖峰集团'), ('603825', '华扬联众'), ('300931', '通用电梯'),
               ('600356', '恒丰纸业'), ('603895', '天永智能'), ('300938', '信测标准'), ('603181', '皇马科技'),
               ('000637', '茂化实华'), ('002009', '天奇股份'), ('600382', '广东明珠'), ('002062', '宏润建设'),
               ('600819', '耀皮玻璃'), ('300213', '佳讯飞鸿'), ('603686', '福龙马'), ('300481', '濮阳惠成'),
               ('001282', '三联锻造'), ('601519', '大智慧'), ('688350', '富淼科技'), ('603681', '永冠新材'),
               ('600104', '上汽集团'), ('600682', '南京新百'), ('300150', '世纪瑞尔'), ('002661', '克明食品'),
               ('603356', '华菱精工'), ('002331', '皖通科技'), ('001318', '阳光乳业'), ('600386', '北巴传媒'),
               ('603386', '骏亚科技'), ('002187', '广百股份'), ('000912', '泸天化'), ('301119', '正强股份'),
               ('300335', '迪森股份'), ('603489', '八方股份'), ('002852', '道道全'), ('300043', '星辉娱乐'),
               ('605011', '杭州热电'), ('603956', '威派格'), ('605133', '嵘泰股份'), ('300426', '唐德影视'),
               ('600170', '上海建工'), ('002486', '嘉麟杰'), ('002617', '露笑科技'), ('300994', '久祺股份'),
               ('000721', '西安饮食'), ('000655', '金岭矿业'), ('300638', '广和通'), ('603040', '新坐标'),
               ('001278', '一彬科技'), ('001202', '炬申股份'), ('605378', '野马电池'), ('605055', '迎丰股份'),
               ('000955', '欣龙控股'), ('002370', '亚太药业'), ('301019', '宁波色母'), ('002029', '七 匹 狼'),
               ('002501', '利源股份'), ('603103', '横店影视'), ('603163', '圣晖集成'), ('002044', '美年健康'),
               ('002006', '精工科技'), ('600280', '中央商场'), ('603053', '成都燃气'), ('600215', '派斯林')]

stock_daily, stock_weekly, stock_monthly = {}, {}, {}
for i in range(min(len(stocks_code), debug_num)):
    try:
        # print('**** load K line : ', stocks_code[i][0])
        stock_daily[stocks_code[i][0]], stock_weekly[stocks_code[i][0]], stock_monthly[stocks_code[i][0]] = \
            load_stocks(save_file, action_date, stocks_code[i][0])

        # print(stock_daily[stocks_code[i][0]][['日期', '收盘', '成交量']])
        # print(stock_weekly[stocks_code[i][0]][['日期', '收盘', '成交量']])
        # print(stock_monthly[stocks_code[i][0]][['日期', '收盘', '成交量']])
    except:
        print('**** has no day week month K line: ', stocks_code[i][0])
print('*' * 50 + ' 03 召回数据完毕')

win_rate_list = []
stocks_code_industry_concept = {}
for i in range(min(len(stocks_code), debug_num)):
    stock_data = stock_daily[stocks_code[i][0]][['日期', '涨跌幅']]
    win_rate_list.append(stock_data.iloc[-1, 1])
    stocks_code_industry_concept[stocks_code[i][0]] = [[], [], stock_data.iloc[-1, 1], stocks_code[i][1]]

industry_list = ak.stock_board_industry_name_em()
concept_list = ak.stock_board_concept_name_em()

for name in list(industry_list['板块名称']):
    industry_stock = ak.stock_board_industry_cons_em(name)
    for i in range(min(len(stocks_code), debug_num)):
        if stocks_code[i][0] in list(industry_stock['代码']):
            stocks_code_industry_concept[stocks_code[i][0]][0].append(name)

for name in list(concept_list['板块名称']):
    concept_stocks = ak.stock_board_concept_cons_em(name)
    for i in range(min(len(stocks_code), debug_num)):
        if stocks_code[i][0] in list(concept_stocks['代码']):
            stocks_code_industry_concept[stocks_code[i][0]][1].append(name)

print('*' * 20 + ' 明细情况')
print('*' * 20 + ' 分析日期: ', action_date, ', 读取文件夹', save_file)

# for i in range(min(len(stocks_code), debug_num)):
#     print(stocks_code[i][0], stocks_code[i][1],
#           ' , 涨跌幅:', stocks_code_industry_concept[stocks_code[i][0]][2],
#           ' , 行业:', stocks_code_industry_concept[stocks_code[i][0]][0],
#           ' , 概念:', stocks_code_industry_concept[stocks_code[i][0]][1])

stocks_code_sorted = dict(sorted(stocks_code_industry_concept.items(),
                                 key=lambda item: item[1][2],
                                 reverse=True))
for key, val in stocks_code_sorted.items():
    print(key, val[3], ' ,涨跌幅:', val[2], ' ,行业:', val[0], ' ,概念:', val[1])

print('*' * 20 + ' 胜率情况')
win_num = len([1 for i in win_rate_list if i > 0])
print(win_num, len(win_rate_list), win_num / len(win_rate_list))
