import time
import akshare as ak
import numpy as np
from numpy import empty
import pandas as pd
import datetime as dt

# 处理时间
from dateutil.parser import parse
from datetime import datetime, timedelta
from chinese_calendar import is_workday, is_holiday

from utils_stock import *

debug_num = 20000000000000000
# action_date = dt.date.today()
action_date = '2024-12-19'
save_file = 'stock_A_2024_12_19'
stocks_code =[('300270', '中威电子'), ('605180', '华生科技'), ('603088', '宁波精达'), ('002918', '蒙娜丽莎'), ('002283', '天润工业'), ('002395', '双象股份'), ('688071', '华依科技'), ('002905', '金逸影视'), ('600157', '永泰能源'), ('600814', '杭州解百'), ('300382', '斯莱克'), ('600673', '东阳光'), ('301125', '腾亚精工'), ('688620', '安凯微'), ('300299', '富春股份'), ('600300', '维维股份'), ('605018', '长华集团'), ('300113', '顺网科技'), ('002747', '埃斯顿'), ('300792', '壹网壹创'), ('002235', '安妮股份'), ('002796', '世嘉科技'), ('002418', '康盛股份'), ('002643', '万润股份'), ('605338', '巴比食品'), ('002670', '国盛金控'), ('300612', '宣亚国际'), ('300793', '佳禾智能'), ('603536', '惠发食品'), ('002026', '山东威达'), ('002860', '星帅尔'), ('301102', '兆讯传媒'), ('002186', '全 聚 德'), ('603897', '长城科技'), ('600853', '龙建股份'), ('002946', '新乳业'), ('002362', '汉王科技'), ('300231', '银信科技'), ('002990', '盛视科技'), ('300499', '高澜股份'), ('600618', '氯碱化工'), ('688737', '中自科技'), ('000788', '北大医药'), ('301027', '华蓝集团'), ('600827', '百联股份'), ('002172', '澳洋健康'), ('002576', '通达动力'), ('300830', '金现代'), ('301303', '真兰仪表'), ('688219', '会通股份'), ('300503', '昊志机电'), ('000501', '武商集团'), ('603223', '恒通股份'), ('603843', '正平股份'), ('600158', '中体产业'), ('002919', '名臣健康'), ('603759', '海天股份'), ('001209', '洪兴股份'), ('002915', '中欣氟材'), ('002563', '森马服饰'), ('300022', '吉峰科技'), ('002139', '拓邦股份'), ('000995', '皇台酒业'), ('002481', '双塔食品'), ('002320', '海峡股份'), ('002114', '罗平锌电'), ('600626', '申达股份'), ('002239', '奥特佳'), ('600959', '江苏有线'), ('600716', '凤凰股份'), ('600082', '海泰发展'), ('300903', '科翔股份'), ('300738', '奥飞数据'), ('300932', '三友联众'), ('600858', '银座股份'), ('301007', '德迈仕'), ('300701', '森霸传感'), ('002551', '尚荣医疗'), ('002697', '红旗连锁'), ('300383', '光环新网'), ('605155', '西大门'), ('688255', '凯尔达'), ('002337', '赛象科技'), ('600979', '广安爱众'), ('002908', '德生科技'), ('002541', '鸿路钢构'), ('002127', '南极电商'), ('605199', '葫芦娃'), ('002105', '信隆健康'), ('002899', '英派斯'), ('300711', '广哈通信'), ('300488', '恒锋工具'), ('605337', '李子园'), ('603335', '迪生力'), ('301198', '喜悦智行'), ('000534', '万泽股份'), ('002449', '国星光电'), ('002695', '煌上煌'), ('002162', '悦心健康'), ('300242', '佳云科技'), ('002515', '金字火腿'), ('301302', '华如科技'), ('300938', '信测标准'), ('300182', '捷成股份'), ('688098', '申联生物'), ('603861', '白云电器'), ('002689', '远大智能'), ('000698', '沈阳化工'), ('601969', '海南矿业'), ('300703', '创源股份'), ('300603', '立昂技术'), ('002470', '金正大'), ('603216', '梦天家居'), ('000631', '顺发恒业'), ('601609', '金田股份'), ('603489', '八方股份'), ('600560', '金自天正'), ('688360', '德马科技'), ('603609', '禾丰股份'), ('300326', '凯利泰'), ('600191', '华资实业'), ('002535', '林州重机'), ('603701', '德宏股份'), ('603719', '良品铺子'), ('688217', '睿昂基因'), ('603386', '骏亚科技'), ('600429', '三元股份'), ('605388', '均瑶健康'), ('300945', '曼卡龙'), ('000663', '永安林业'), ('605389', '长龄液压'), ('601216', '君正集团'), ('603696', '安记食品'), ('600630', '龙头股份'), ('600097', '开创国际'), ('002857', '三晖电气'), ('002286', '保龄宝'), ('002886', '沃特股份'), ('601188', '龙江交通'), ('001231', '农心科技'), ('600137', '浪莎股份'), ('002678', '珠江钢琴'), ('002331', '皖通科技'), ('603519', '立霸股份'), ('600882', '妙可蓝多'), ('603637', '镇海股份'), ('605555', '德昌股份'), ('605088', '冠盛股份'), ('002164', '宁波东力'), ('002497', '雅化集团'), ('603881', '数据港'), ('301055', '张小泉'), ('688178', '万德斯'), ('301335', '天元宠物'), ('600697', '欧亚集团'), ('600851', '海欣股份'), ('603988', '中电电机'), ('002046', '国机精工'), ('600616', '金枫酒业'), ('300692', '中环环保'), ('300263', '隆华科技'), ('301116', '益客食品'), ('000735', '罗 牛 山'), ('600326', '西藏天路'), ('603002', '宏昌电子'), ('601238', '广汽集团'), ('000156', '华数传媒'), ('301119', '正强股份'), ('002398', '垒知集团'), ('688529', '豪森智能'), ('600738', '丽尚国潮'), ('000882', '华联股份'), ('603163', '圣晖集成'), ('300040', '九洲集团'), ('002501', '利源股份'), ('002927', '泰永长征'), ('300448', '浩云科技'), ('001282', '三联锻造'), ('300931', '通用电梯'), ('002587', '奥拓电子'), ('688669', '聚石化学'), ('605055', '迎丰股份'), ('000637', '茂化实华'), ('600337', '美克家居'), ('600335', '国机汽车'), ('300994', '久祺股份'), ('003033', '征和工业'), ('002530', '金财互联'), ('001278', '一彬科技'), ('300897', '山科智能'), ('002171', '楚江新材'), ('002068', '黑猫股份'), ('601798', '蓝科高新'), ('600857', '宁波中百'), ('603300', '海南华铁'), ('603681', '永冠新材'), ('600382', '广东明珠'), ('603180', '金牌家居'), ('603181', '皇马科技'), ('600819', '耀皮玻璃'), ('601011', '宝泰隆'), ('002702', '海欣食品'), ('002069', '獐子岛'), ('603232', '格尔软件'), ('688097', '博众精工'), ('605319', '无锡振华'), ('600829', '人民同泰'), ('002062', '宏润建设'), ('688613', '奥精医疗'), ('600356', '恒丰纸业'), ('600170', '上海建工'), ('600215', '派斯林'), ('000890', '法尔胜'), ('300079', '数码视讯'), ('688683', '莱尔科技'), ('603040', '新坐标'), ('603686', '福龙马'), ('300906', '日月明'), ('605133', '嵘泰股份'), ('300213', '佳讯飞鸿'), ('300706', '阿石创'), ('002104', '恒宝股份'), ('300141', '和顺电气'), ('688373', '盟科药业-U'), ('603116', '红蜻蜓'), ('000655', '金岭矿业'), ('300288', '朗玛信息'), ('002826', '易明医药'), ('688327', '云从科技-UW'), ('300112', '万讯自控'), ('001202', '炬申股份'), ('000920', '沃顿科技'), ('601519', '大智慧'), ('605050', '福然德'), ('300962', '中金辐照')]


stock_daily, stock_weekly, stock_monthly = {}, {}, {}
for i in range(min(len(stocks_code), debug_num)):
    try:
        # print('**** load K line : ', stocks_code[i][0])
        stock_daily[stocks_code[i][0]], stock_weekly[stocks_code[i][0]], stock_monthly[stocks_code[i][0]] = \
            load_stocks(save_file, action_date, stocks_code[i][0])

        # print(stock_daily[stocks_code[i][0]][['日期', '收盘', '成交量']])
        # print(stock_weekly[stocks_code[i][0]][['日期', '收盘', '成交量']])
        # print(stock_monthly[stocks_code[i][0]][['日期', '收盘', '成交量']])
    except:
        print('**** has no day week month K line: ', stocks_code[i][0])
print('*' * 50 + ' 03 召回数据完毕')

win_rate_list = []
stocks_code_industry_concept = {}
for i in range(min(len(stocks_code), debug_num)):
    stock_data = stock_daily[stocks_code[i][0]][['日期', '涨跌幅']]
    win_rate_list.append(stock_data.iloc[-1, 1])
    stocks_code_industry_concept[stocks_code[i][0]] = [[], [], stock_data.iloc[-1, 1], stocks_code[i][1]]

industry_list = ak.stock_board_industry_name_em()
concept_list = ak.stock_board_concept_name_em()

for name in list(industry_list['板块名称']):
    industry_stock = ak.stock_board_industry_cons_em(name)
    for i in range(min(len(stocks_code), debug_num)):
        if stocks_code[i][0] in list(industry_stock['代码']):
            stocks_code_industry_concept[stocks_code[i][0]][0].append(name)

for name in list(concept_list['板块名称']):
    concept_stocks = ak.stock_board_concept_cons_em(name)
    for i in range(min(len(stocks_code), debug_num)):
        if stocks_code[i][0] in list(concept_stocks['代码']):
            stocks_code_industry_concept[stocks_code[i][0]][1].append(name)

print('*' * 20 + ' 明细情况')
print('*' * 20 + ' 分析日期: ', action_date, ', 读取文件夹', save_file)

# for i in range(min(len(stocks_code), debug_num)):
#     print(stocks_code[i][0], stocks_code[i][1],
#           ' , 涨跌幅:', stocks_code_industry_concept[stocks_code[i][0]][2],
#           ' , 行业:', stocks_code_industry_concept[stocks_code[i][0]][0],
#           ' , 概念:', stocks_code_industry_concept[stocks_code[i][0]][1])

stocks_code_sorted = dict(sorted(stocks_code_industry_concept.items(),
                                 key=lambda item: item[1][2],
                                 reverse=True))
for key, val in stocks_code_sorted.items():
    print(key, val[3], ' ,涨跌幅:', val[2], ' ,行业:', val[0], ' ,概念:', val[1])

print('*' * 20 + ' 胜率情况')
win_num = len([1 for i in win_rate_list if i > 0])
print(win_num, len(win_rate_list), win_num / len(win_rate_list))
