# https://fund.eastmoney.com/data/fbsfundranking.html#tct;c0;r;s1nzf;ddesc;pn50;
# http://fund.eastmoney.com/cnjy_jzzzl.html
'''
https://www.zhihu.com/question/419752967/answer/4404602590
https://www.zhihu.com/search?type=content&q=%E6%8C%87%E6%95%B0%20%E5%9C%BA%E5%86%85etf%20%E5%88%97%E8%A1%A8
https://zhuanlan.zhihu.com/p/457262945
https://zhuanlan.zhihu.com/p/686364633

https://zhuanlan.zhihu.com/p/462030508


AI量化实验室 http://www.ailabx.com/profile
飞狐量化
https://zhuanlan.zhihu.com/p/687585481
https://mp.weixin.qq.com/s?__biz=MzIwNTU2ODMwNg==&mid=2247490386&idx=3&sn=1e1bd56db7265537356e829d2337f90f&chksm=972fbb0fa0583219d439e4c0a7ef0526feca6b65382c1d75a4822e9d8b774d4d788464bf9b1d&scene=21#wechat_redirect
https://mp.weixin.qq.com/s?__biz=MzIwNTU2ODMwNg==&mid=2247490309&idx=1&sn=79be131a94391a4cf7a10b7e98aca6e9&chksm=972fbb58a058324efb4b01daa4a0ec82ca2cfe955c3387e1524d63ad29337737e0784f8e96cd&scene=21#wechat_redirect
https://mp.weixin.qq.com/s?__biz=MzIwNTU2ODMwNg==&mid=2247490365&idx=1&sn=ed553170a95d231224ba236a154cfd49&chksm=972fbb60a058327647642a84c7742c6e6e60538357c0df3e49933eca0c1f689947946ff5a70a&scene=21#wechat_redirect
https://mp.weixin.qq.com/s?__biz=MzIwNTU2ODMwNg==&mid=2247490283&idx=1&sn=6abafc1fc40bf9acd95009b79ba77dd1&chksm=972fbab6a05833a071908b653ddccf61e6dc02e92ebf62983be30306d8befd84dbd9ad14ff2d&scene=21#wechat_redirect
'''

ETF_01 = [
    # 宽基指数ETF
    [510050, '上证50ETF'],
    [510300, '沪深300ETF'],
    [512910, '中证100ETF'],
    [510500, '中证500ETF'],
    [512100, '中证1000ETF'],
    [159901, '深100ETF'],
    [159949, '创业板50'],
    [159915, '创业板'],
    [588000, '科创50ETF'],

    # # 策略型指数ETF
    [510880, '红利ETF'],
    [512260, '中证500低波动'],
    [159910, '基本面120ETF'],

    # 香港恒生宽基指数ETF
    [510900, 'H股ETF'],
    [159920, '恒生ETF'],
    [513090, '香港证券ETF'],
    [513060, '恒生医疗ETF'],
    [513180, '恒生科技指数ETF'],
    [513330, '恒生互联网ETF'],
    [159735, '港股消费'],
    [159960, '恒生国企'],

    # 海外市场T+0的ETF基金
    # [513100, '纳指ETF'],
    # [159612, '标普500ETF'],
    # [513520, '日经ETF'],
    # [164824, '印度基金LOF'],
    # [513730, '东南亚科技ETF'],
    # [513030, '德国ETF'],
    # [513080, '法国CAC40ETF'],

    # 黄金
    [518880, '黄金'],

    # 可转债
    # [511380, '可转债']

    # 科技大类
    # ['159995', '芯片'],
    # ['515000', '科技'],
    # ['512720', '计算机'],
    # ['512480', '半导体'],
    # ['512760', '半导体50'],
    # ['515580', '中证科技'],
    # ['515980', '人工智能'],
    # ['588080', '科创50'],
    # ['515050', '5G'],
    # ['515260', '电子'],
    # ['515790', '光伏'],
    # ['515700', '新能源车'],

    # 顺周期
    # [512800, '银行'],
    # [512200, '地产'],
    # [512580, '环保'],
    # [512400, '有色'],
    # [515220, '煤炭'],
    # [510170, '大宗商品'],
    # [161129, '原油'],
    # [515210, '钢铁'],
    # [159981, '能源化工'],

    # 大消费
    # [512690, '酒'],
    # [512980, '传媒'],
    # [510150, '消费'],
    # [512290, '生物医药'],
    # [512170, '医疗'],
    # [159843, '食品饮料'],
    # [159996, '家电'],

]

ETF_industry = [
    # 大金融行业指数基金
    # [512880, '证券ETF'],
    # [512800, '银行ETF'],
    # [510230, '金融ETF'],

    # 大医药行业指数基金
    # [512010, '医药ETF'],
    # [512170, '医疗ETF'],
    # [159992, '创新药'],

    # 大消费行业指数基金
    # [512690, '酒ETF'],
    # [515170, '食品饮料ETF'],
    # [159996, '家电ETF'],

    # 新能源车行业指数基金
    [515030, '新能源车ETF'],
    [516160, '新能源ETF'],
    [516520, '智能驾驶ETF'],

    # 大科技行业指数基金
    [159995, '芯片ETF'],
    [512480, '半导体ETF'],
    [515230, '软件ETF'],
    [515000, '科技ETF'],
    [515050, '5GETF'],
    [515880, '通信ETF'],
    [159939, '信息技术'],
    [159897, '物联ETF'],
    [159856, '互联网50'],
    [512720, '计算机ETF'],

    # 大军工行业指数基金
    # [512660, '军工ETF'],
    # [512670, '国防ETF'],

    # 化工光伏行业指数基金
    # [516220, '化工龙头ETF'],
    # [515790, '光伏ETF'],
    # [159703, '新材料'],

    # 大制造行业指数基金
    [516800, '智能制造ETF'],
    [516320, '高端装备ETF'],
    [516960, '机械ETF'],

    # 资源类行业指数基金
    [518880, '黄金ETF'],
    [512400, '有色金属ETF'],
    [516780, '稀土ETF'],
    [515210, '钢铁ETF'],
    [515220, '煤炭ETF'],

    # 文化类行业指数基金
    [159869, '游戏ETF'],
    [513360, '教育ETF'],
    [512980, '传媒ETF'],

    # 大农业指数基金
    [159865, '养殖ETF'],
    [159867, '畜牧ETF'],
    [159825, '农业ETF'],

    # 大基建行业指数基金
    # [159745, '建材ETF'],
    # [516950, '基建ETF'],
    # [512200, '房地产ETF'],

    # 其他行业指数基金
    # [159861, '环保ETF'],
    # [516070, '低碳ETF'],
    # [516910, '物流ETF'],
]
